Revit 2026 API

# ViewPlanType Enumeration

---

An enumerated type listing plan view types.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ViewPlanType
```
```vb
Public Enumeration ViewPlanType
```
```cpp
public enum class ViewPlanType
```
```fsharp
type ViewPlanType
```

| Member name | Value | Description |
| --- | --- | --- |
| CeilingPlan | 2 | Reflected ceiling plan view. |
| FloorPlan | 1 | Floor plan view. |

#### Reference

Autodesk.Revit.DB Namespace